import React from "react";
import Image from "next/image";
import { H1 } from "@/components/typography";

const page = ({ params }: { params: { lang: string } }) => {
  const { lang } = params;
  return (
    <div>
      <H1 className="text-center font-semibold md:mt-5">संस्थाको परिचय</H1>
      <div className="space-y-10 px-2 py-10 md:py-20">
        <Image
          src="/about/hero.svg"
          alt="heroimg"
          className="h-[400px] w-screen object-cover object-center"
          height={0}
          width={500}
        />
        <div>
          <p className="text-md md:pl-4 md:pr-8">
            नेपाल बहु जातीय, बहुभाषिक र बहु सांस्कृतिक मुलुक हो । यहाँ आ–आफ्नो
            भाषा, धर्म संस्कृति, परम्परा रीतिरिवाज रही आएका छन् । देश तथा
            विदेशमा रहेका कौडिन्य सगोत्रीय आचार्यहरूको आन्तरिक एकता सुदृढ गर्दै,
            वंश, परम्परा, उत्पत्ति, इतिहास र समाजका विविध क्षेत्रमा विशेष योगदान
            पुर्‍याउने अवधारणा स्वरूप आचार्य बन्धु समाज-नेपालको स्थापना भएको हो
            । २०६९ सालमा काठमाडौँ जिल्ला प्रशासन कार्यालयमा विधिवत् दर्ता गरी
            स्थापना भएको यस आचार्य बन्धु समाज नेपालको केन्द्रीय कार्यालय हाल
            काठमाडौँ महानगरपालिका वडा -१०, मध्य बानेश्वर रहेको छ ।
            <br />
            <br />
            कौडिन्य सगोत्रीय आचार्यहरूको क्रियाशीलतामा स्थापित यो संस्था
            जनहितकारी, मुनाफारहित संस्था हो । कौडिन्य सगोत्रीय आचार्यहरू बिच
            आन्तरिक एकता सुदृढ गरी रचनात्मक धारणा निर्माण गर्दै बन्धुहरूको खोज
            तथा ऐतिहासिक अध्ययन अनुसन्धान, विश्लेषण र विवेचना गरी स्वधर्म,
            चाडपर्व, रीतिरिवाज, परम्परा, संस्कृति आदिलाई बचाउँदै आपसमा एकता,
            सद्‌भाव, सहयोग, मातृत्व भाइचाराको विकास गरी देश विदेशमा रहेका
            कौडिन्य आचार्यहरूबिच न्यानो सम्बन्ध स्थापना गर्दै सामाजिक काममा
            दत्तचित्त भएर लाग्ने मूल उद्देश्यका साथ यो संस्था मार्गदर्शक
            संस्थाको रूपमा स्थापना भएको हो ।
            <br />
            <br />
            यस संस्थाको २०७५ सालको पहिलो संशोधित विधान अनुसार अध्यक्ष सहित २१
            जनाको कार्यसमिति रहने व्यवस्था रहेको छ ।, जसमा पदाधिकारीसहित १७ जना
            अधिवेशनबाट निर्वाचित र ४ जना अध्यक्षबाट मनोनीत हुनेछन् । यस संस्थामा
            साधारण सदस्य, आजीवन सदस्य, विशिष्ट सदस्य, संरक्षक सदस्य र राष्ट्रका
            लागि महत्त्वपूर्ण योगदान पुर्‍याउने जो सुकै विशिष्ट व्यक्तित्वलाई
            कार्यसमितिले मानार्थ सदस्य प्रदान गर्न सकिने वैधानिक व्यवस्था रहेको
            छ । यस संस्थाले आफ्नो गतिविधि र क्रियाकलापहरू नियमित रूपमा अगाडि
            बढाइरहेको ब्यहोरा अवगत गर्दै संस्थाले नियमित भेटघाट, संस्थाको निर्णय
            अनुरूप गठन भएका विभागहरू बिच समन्वय, नियमित बैठक, सामाजिक
            अन्तरक्रिया कार्यक्रम, आर्थिक सहयोग, शैक्षिक प्रोत्साहन वनभोज,
            भित्ते पात्रो र जानकारीमूलक प्रकाशन, रक्तदान, श्रमदान, वृक्षारोपण,
            जन्म जयन्ती, दही–चिउरा, जस्ता हितकारी क्रियाकलापहरू तथा सामाजिक तथा
            सांस्कृतिक रूपमा एकताबद्ध हुने कार्यक्रमहरू सञ्चालन गरी रहेको र
            गर्दै आएको छ । प्रदेश, जिल्ला र स्थानीय तह स्तरीय समिति गठन गरी सो
            क्षेत्रमा, आचार्य वंशीय कौडिन्य सगोत्रीय बन्धुहरूको जमघट र रचनात्मक
            कामहरूलाई निरन्तरता दिँदै आइरहेको छ । यस संस्थालाई प्रविधि मैत्री
            बनाउन तथा संस्थाका गतिविधिहरूलाई आम रूपमा पुर्‍याउँदै सबै तहका
            कामकारबाहीलाई सहज र पारदर्शी बनाउन आफ्नो धारणा सुझाव समेत सम्मिलित
            गर्न मिल्ने गरी आफ्नै वेभ साइट धधध।बअजबचथबकबmबव।यचन निर्माण भई सकेको
            छ । छिटोछरितोसँग सम्पूर्ण आचार्य बन्धु बिचमा पुग्न सकिनेछ भन्ने
            अपेक्षा लिएका छौँ । आगामी दिनमा सम्पूर्ण आचार्य बन्धु, शुभ
            चिन्तकहरूको सुझाव सल्लाह अनुसार यस संस्थालाई अगाडि बढाउने र विश्वभर
            छरिएर रहनुभएका कौडिन्य सगोत्रीय आचार्यहरूलाई एउटै मालामा आबद्ध
            गराउनको लागि कौडिन्य सगोत्रीय आचार्य बन्धुहरूलाई मन वचन र कर्मले यस
            समाजसँग आबद्ध गराउँदै अगाडि बढिरहेको अवस्था छ । संस्थाले काठमाडौँमा
            आचार्य सेवा सदन निर्माण गर्ने, इ–वंशावली–प्रकाशित गर्ने लगायतका लक्ष
            सार्वजनिक गरिसकेको छ । आदिकवि भानुभक्त आचार्य, इतिहास शिरोमणि
            बाबुराम आचार्य, ज्युँदा सहिद पूर्व प्रधानमन्त्री टङ्क प्रसाद
            आचार्यलगायत आचार्यहरूका अग्रज पूर्वजको जन्म जयन्ती मनाउने लगायतका
            कार्यक्रम समाज स्थापना हुनु अगाडिदेखि नै आचार्य समाजले गर्दै आएको छ
            । संस्थाले २०८० साल देखि अलि बढी सक्रिय हुँदै देश, विदेशका
            आचार्यहरूलाई समाजका राम्रा क्रियाकलापको बारेमा चिनाउँदै सामाजिक
            हितका महत्त्वपूर्ण सामाजिक कार्य गर्ने अठोट गरेको छ । यसमा विश्वभर
            बस्ने कौडिन्य सगोत्रीय बन्धुहरूको सल्लाह, सुझाव, खबरदारीको भावनासहित
            हातेमालोको आवश्यकता रहेको समाजको ठहर छ ।
          </p>
        </div>
      </div>
    </div>
  );
};

export default page;
